## DBMS Lab

### Database Creation and Connectivity

In [124]:
import mysql.connector
import prettytable
import pandas as pd

In [6]:
mydb = mysql.connector.connect(
                host = "localhost",
                user = "root",
                password = "Santoshkyn14@"
                                )
if(mydb):
    print("Connection Successful")
else:
    print("Connection Unsuccessful")

Connection Successful

In [7]:
mycursor = mydb.cursor()

In [9]:
mycursor.execute("create database Library_Management")

In [125]:
mydb = mysql.connector.connect(
                host = "localhost",
                user = "root",
                password = "Santoshkyn14@",
                database = "Library_Management"
                )
if(mydb):
    print("Connection Successful")
else:
    print("Connection Unsuccesful")

Connection Successful

In [126]:
mycursor = mydb.cursor()
print(mycursor)

CMySQLCursor: (Nothing executed yet)

## Queries Function

In [127]:
def Create_Table(mycursor = "",table_name = "Unknown", columns = [], columns_type = [], num = [], features = [], primary_key = [], foreign_key = [], reference = []):
    try:
        if(columns == [] or columns_type == [] and mycursor == ""):
            print("Please enter attributes for the tables with proper type")
        else:
            string = "create table " + table_name + "("
            for i,j,k in zip(columns, columns_type, num):
                string = string + i+" "+j +"(" + str(k) + ")"
                if(features != []):
                    string = string + features.pop(0) + ","
                else:
                    string = string + ","
            if(primary_key != []):
                string = string + "primary key(" + primary_key.pop(0) + ")," 
            for i,j in zip(foreign_key, reference):
                string = string + "foreign key (" + i + ") " + "references " + j+","
            string = string[0:len(string) - 1]
            string = string + ")"
            print(string)
            mycursor.execute(string)
    except Exception as e:
        print("Create Table Failed")
        print(e)

In [128]:
def Table_Type(mycursor = "", table_name = ""):
    try:
        if(table_name == "" or mycursor == ""):
            print("Please give the data of necessary attributes")
        else:
            mycursor.execute("desc " + table_name)
            x = prettytable.PrettyTable(["Field", "Type","Null", "Key", "Default", "Extra"])
            for i in mycursor:
                x.add_row(list(i))
            print(x)
            return x
    except Exception as e:
        print("Code failed in table type")
        print(e)

In [144]:
def Insert_into_Table(mycursor = mycursor,table_name=[], values=[]):
    try:
        if(table_name == [] or values == []):
            print("Please improve the parameter")
        else:
            string = "insert into "+table_name 
            mycursor.execute("desc " + table_name)
            string = string + "("
            for i in mycursor:
                string = string + i[0] +","
            string = string[0: len(string) - 1]
            string = string + ")"
            string = string + " values("
            for i in values:
                if(type(i) == str):
                    string = string + "'"
                    string = string + "{}".format(i)
                    string = string + "',"
                else:
                    string = string + "{}".format(i)
                    string = string + ","
            string = string[0:len(string)-1]
            string = string + ")"
        print(string)
        mycursor.execute(string)
    except Exception as e:
        print(e)

In [130]:
def Show_Table(mycursor = mycursor, table_name = []):
    try:
        if(table_name == []):
            print("Please give table name")
        else:
            column = []
            mycursor.execute("desc "+ table_name)
            for i in mycursor:
                column.append(str(i[0]))
            x = prettytable.PrettyTable(column)
            mycursor.execute("select * from " + table_name)
            for i in mycursor:
                x.add_row(list(i))
            print(x)
    except Exception as e:
        print(e)
        print("Code failed in show table")

## Table Creation and Table Overview

In [26]:
Create_Table(mycursor = mycursor,table_name= "SiuLibrary1",
            columns=["Slid","lname","location","noofbranches"], 
            columns_type=["int","varchar", "varchar","varchar"],
            num=[10, 100, 100, 100],
            primary_key=["Slid"])

In [26]:
Table_Type(table_name="SiuLibrary1", mycursor=mycursor)

+--------------+-----------------+------+-----+---------+-------+
|    Field     |       Type      | Null | Key | Default | Extra |
+--------------+-----------------+------+-----+---------+-------+
|     Slid     |      b'int'     |  NO  | PRI |   None  |       |
|    lname     | b'varchar(100)' | YES  |     |   None  |       |
|   location   | b'varchar(100)' | YES  |     |   None  |       |
| noofbranches | b'varchar(100)' | YES  |     |   None  |       |
+--------------+-----------------+------+-----+---------+-------+

In [30]:
Create_Table(mycursor = mycursor, table_name="Ilibrary",
             columns=["Lid", "lname", "City","Area","Slid"],
             columns_type=["int","varchar","varchar","varchar","int"],
             num=[10,255,255,255,10],
             primary_key=["Lid"],
             foreign_key=["Slid"],
             reference=["SiuLibrary1(Slid)"]
            )

In [31]:
Table_Type(mycursor=mycursor, table_name="Ilibrary")

+-------+-----------------+------+-----+---------+-------+
| Field |       Type      | Null | Key | Default | Extra |
+-------+-----------------+------+-----+---------+-------+
|  Lid  |      b'int'     |  NO  | PRI |   None  |       |
| lname | b'varchar(255)' | YES  |     |   None  |       |
|  City | b'varchar(255)' | YES  |     |   None  |       |
|  Area | b'varchar(255)' | YES  |     |   None  |       |
|  Slid |      b'int'     | YES  | MUL |   None  |       |
+-------+-----------------+------+-----+---------+-------+

In [32]:
Create_Table(mycursor=mycursor, table_name="Books",
             columns=["Bid","Bname","Price","Lid"],
             columns_type=["int","varchar","int","int"],
             num=[10,225,10,10],
             primary_key=["Bid"],
             foreign_key=["Lid"],
             reference=["Ilibrary(Lid)"]
            )

In [33]:
Table_Type(mycursor, table_name="Books")

+-------+-----------------+------+-----+---------+-------+
| Field |       Type      | Null | Key | Default | Extra |
+-------+-----------------+------+-----+---------+-------+
|  Bid  |      b'int'     |  NO  | PRI |   None  |       |
| Bname | b'varchar(225)' | YES  |     |   None  |       |
| Price |      b'int'     | YES  |     |   None  |       |
|  Lid  |      b'int'     | YES  | MUL |   None  |       |
+-------+-----------------+------+-----+---------+-------+

In [34]:
Create_Table(mycursor, table_name="Noofcopies",
             columns=["Bnid","Bid","Blid"],
             columns_type=["int","int","int"],
             num=[10,10,10],
             primary_key=["Bnid"],
             foreign_key=["Bid"],
             reference=["Books(Bid)"]
            )

In [35]:
Table_Type(mycursor, "Noofcopies")

+-------+--------+------+-----+---------+-------+
| Field |  Type  | Null | Key | Default | Extra |
+-------+--------+------+-----+---------+-------+
|  Bnid | b'int' |  NO  | PRI |   None  |       |
|  Bid  | b'int' | YES  | MUL |   None  |       |
|  Blid | b'int' | YES  |     |   None  |       |
+-------+--------+------+-----+---------+-------+

In [38]:
Create_Table(mycursor, table_name="Author",
             columns=["Aid","Aname","email","PhoneNo"],
             columns_type=["int","varchar","varchar","int"],
             num=[10,255,255,20],
             primary_key=["Aid"]
            )

In [39]:
Table_Type(mycursor, "Author")

+---------+-----------------+------+-----+---------+-------+
|  Field  |       Type      | Null | Key | Default | Extra |
+---------+-----------------+------+-----+---------+-------+
|   Aid   |      b'int'     |  NO  | PRI |   None  |       |
|  Aname  | b'varchar(255)' | YES  |     |   None  |       |
|  email  | b'varchar(255)' | YES  |     |   None  |       |
| PhoneNo |      b'int'     | YES  |     |   None  |       |
+---------+-----------------+------+-----+---------+-------+

In [40]:
Create_Table(mycursor, table_name="Writes",
             columns=["Bid","Aid","Pid"],
             columns_type=["int","int","int"],
             num = [10,10,10],
             primary_key=["Pid"],
             foreign_key=["Aid","Bid"],
             reference=["Author(AId)","Books(Bid)"]
            )

In [41]:
Table_Type(mycursor, "Writes")

+-------+--------+------+-----+---------+-------+
| Field |  Type  | Null | Key | Default | Extra |
+-------+--------+------+-----+---------+-------+
|  Bid  | b'int' | YES  | MUL |   None  |       |
|  Aid  | b'int' | YES  | MUL |   None  |       |
|  Pid  | b'int' |  NO  | PRI |   None  |       |
+-------+--------+------+-----+---------+-------+

In [42]:
Create_Table(mycursor, table_name="Publisher",
             columns=["Pid","Pname"],
             columns_type=["int","varchar"],
             num = [10,255],
             primary_key=["Pid"]
            )

In [43]:
Table_Type(mycursor, "Publisher")

+-------+-----------------+------+-----+---------+-------+
| Field |       Type      | Null | Key | Default | Extra |
+-------+-----------------+------+-----+---------+-------+
|  Pid  |      b'int'     |  NO  | PRI |   None  |       |
| Pname | b'varchar(255)' | YES  |     |   None  |       |
+-------+-----------------+------+-----+---------+-------+

In [44]:
Create_Table(mycursor, table_name="Seller",
             columns=["Sid","slname","City"],
             columns_type=["int","varchar","varchar"],
             num=[10,255,255],
             primary_key=["Sid"]
            )

In [45]:
Table_Type(mycursor, "Seller")

+--------+-----------------+------+-----+---------+-------+
| Field  |       Type      | Null | Key | Default | Extra |
+--------+-----------------+------+-----+---------+-------+
|  Sid   |      b'int'     |  NO  | PRI |   None  |       |
| slname | b'varchar(255)' | YES  |     |   None  |       |
|  City  | b'varchar(255)' | YES  |     |   None  |       |
+--------+-----------------+------+-----+---------+-------+

In [46]:
Create_Table(mycursor,table_name="Department",
             columns=["DeptId","Deptname","Iname","Lid"],
             columns_type=["int","varchar","varchar","int"],
             num=[10,255,255,10],
             primary_key=["DeptId"],
             foreign_key=["Lid"],
             reference=["Ilibrary(Lid)"]
            )

In [47]:
Table_Type(mycursor, "Department")

+----------+-----------------+------+-----+---------+-------+
|  Field   |       Type      | Null | Key | Default | Extra |
+----------+-----------------+------+-----+---------+-------+
|  DeptId  |      b'int'     |  NO  | PRI |   None  |       |
| Deptname | b'varchar(255)' | YES  |     |   None  |       |
|  Iname   | b'varchar(255)' | YES  |     |   None  |       |
|   Lid    |      b'int'     | YES  | MUL |   None  |       |
+----------+-----------------+------+-----+---------+-------+

In [49]:
Create_Table(mycursor, table_name="Member",
             columns=["MemId","Lid"],
             columns_type=["int","int"],
             num=[10,10,10],
             primary_key=["MemId"]
            )

In [50]:
Table_Type(mycursor, "Member")

+-------+--------+------+-----+---------+-------+
| Field |  Type  | Null | Key | Default | Extra |
+-------+--------+------+-----+---------+-------+
| MemId | b'int' |  NO  | PRI |   None  |       |
|  Lid  | b'int' | YES  |     |   None  |       |
+-------+--------+------+-----+---------+-------+

In [231]:
Create_Table(mycursor, table_name="Staff",
             columns=["Stid","stname","email","MemId", "DeptId"],
             columns_type=["int","varchar","varchar","int","int"],
             num=[10,255,255,10,10],
             primary_key=["Stid"],
             foreign_key=["MemId", "DeptId"],
             reference=["Member(MemId)","Department(DeptId)"]
            )

create table Staff(Stid int(10),stname varchar(255),email varchar(255),MemId int(10),DeptId int(10),primary key(Stid),foreign key (MemId) references Member(MemId),foreign key (DeptId) references Department(DeptId))

In [232]:
Table_Type(mycursor, "Staff")

+--------+-----------------+------+-----+---------+-------+
| Field  |       Type      | Null | Key | Default | Extra |
+--------+-----------------+------+-----+---------+-------+
|  Stid  |      b'int'     |  NO  | PRI |   None  |       |
| stname | b'varchar(255)' | YES  |     |   None  |       |
| email  | b'varchar(255)' | YES  |     |   None  |       |
| MemId  |      b'int'     | YES  | MUL |   None  |       |
| DeptId |      b'int'     | YES  | MUL |   None  |       |
+--------+-----------------+------+-----+---------+-------+

In [257]:
Create_Table(mycursor, table_name="Purchase",
             columns=["PrId","Lid","Sid","Pid","Bid","Quantity","Date","TotalCost"],
             columns_type=["int","int","int","int","int","int","varchar","int"],
             num=[10,10,10,10,10,10,255,10],
             primary_key=["PrId"],
             foreign_key=["Sid","Pid","Bid"],
             reference=["Seller(Sid)","Publisher(Pid)","Books(Bid)"],
            )

create table Purchase(PrId int(10),Lid int(10),Sid int(10),Pid int(10),Bid int(10),Quantity int(10),Date varchar(255),TotalCost int(10),primary key(PrId),foreign key (Sid) references Seller(Sid),foreign key (Pid) references Publisher(Pid),foreign key (Bid) references Books(Bid))

In [258]:
Table_Type(mycursor, "Purchase")

+-----------+-----------------+------+-----+---------+-------+
|   Field   |       Type      | Null | Key | Default | Extra |
+-----------+-----------------+------+-----+---------+-------+
|    PrId   |      b'int'     |  NO  | PRI |   None  |       |
|    Lid    |      b'int'     | YES  |     |   None  |       |
|    Sid    |      b'int'     | YES  | MUL |   None  |       |
|    Pid    |      b'int'     | YES  | MUL |   None  |       |
|    Bid    |      b'int'     | YES  | MUL |   None  |       |
|  Quantity |      b'int'     | YES  |     |   None  |       |
|    Date   | b'varchar(255)' | YES  |     |   None  |       |
| TotalCost |      b'int'     | YES  |     |   None  |       |
+-----------+-----------------+------+-----+---------+-------+

In [265]:
Create_Table(mycursor, table_name="Issue",
             columns=["Issueid", "Memid", "Bid", "Lid", "Issuedate", "Returndate"],
             columns_type=["int","int","int","int","varchar","varchar"],
             num=[10,10,10,10,255,255],
             primary_key=["Issueid"]
            )

create table Issue(Issueid int(10),Memid int(10),Bid int(10),Lid int(10),Issuedate varchar(255),Returndate varchar(255),primary key(Issueid))

In [266]:
Table_Type(mycursor, "Issue")

+------------+-----------------+------+-----+---------+-------+
|   Field    |       Type      | Null | Key | Default | Extra |
+------------+-----------------+------+-----+---------+-------+
|  Issueid   |      b'int'     |  NO  | PRI |   None  |       |
|   Memid    |      b'int'     | YES  |     |   None  |       |
|    Bid     |      b'int'     | YES  |     |   None  |       |
|    Lid     |      b'int'     | YES  |     |   None  |       |
| Issuedate  | b'varchar(255)' | YES  |     |   None  |       |
| Returndate | b'varchar(255)' | YES  |     |   None  |       |
+------------+-----------------+------+-----+---------+-------+

In [63]:
Create_Table(mycursor, table_name="Sells",
             columns=["Sid","Bid","Pid"],
             columns_type=["int","int","int"],
             num=[10,10,10],
             foreign_key=["Sid","Bid","Pid"],
             reference=["Seller(Sid)", "Books(Bid)","Publisher(Pid)"],
            )

In [64]:
Table_Type(mycursor, "Sells")

+-------+--------+------+-----+---------+-------+
| Field |  Type  | Null | Key | Default | Extra |
+-------+--------+------+-----+---------+-------+
|  Sid  | b'int' | YES  | MUL |   None  |       |
|  Bid  | b'int' | YES  | MUL |   None  |       |
|  Pid  | b'int' | YES  | MUL |   None  |       |
+-------+--------+------+-----+---------+-------+

In [73]:
Create_Table(mycursor, table_name="Employee",
             columns=["Eid","Empname","email","Salary","Lid"],
             columns_type=["int","varchar","varchar","int","int"],
             num=[10,255,255,10,10]
            )

create table Employee(Eid int(10),Empname varchar(255),email varchar(255),Salary int(10),Lid int(10))

In [74]:
Table_Type(mycursor, "Employee")

+---------+-----------------+------+-----+---------+-------+
|  Field  |       Type      | Null | Key | Default | Extra |
+---------+-----------------+------+-----+---------+-------+
|   Eid   |      b'int'     | YES  |     |   None  |       |
| Empname | b'varchar(255)' | YES  |     |   None  |       |
|  email  | b'varchar(255)' | YES  |     |   None  |       |
|  Salary |      b'int'     | YES  |     |   None  |       |
|   Lid   |      b'int'     | YES  |     |   None  |       |
+---------+-----------------+------+-----+---------+-------+

In [75]:
Create_Table(mycursor, table_name="A_Specialization",
             columns=["Spec_id","Spec_name","Aid"],
             columns_type=["int","varchar","int"],
             num=[10,255,10]
            )

create table A_Specialization(Spec_id int(10),Spec_name varchar(255),Aid int(10))

In [76]:
Table_Type(mycursor, "A_Specialization")

+-----------+-----------------+------+-----+---------+-------+
|   Field   |       Type      | Null | Key | Default | Extra |
+-----------+-----------------+------+-----+---------+-------+
|  Spec_id  |      b'int'     | YES  |     |   None  |       |
| Spec_name | b'varchar(255)' | YES  |     |   None  |       |
|    Aid    |      b'int'     | YES  |     |   None  |       |
+-----------+-----------------+------+-----+---------+-------+

In [216]:
Create_Table(mycursor, table_name="Student",
             columns=["Stuid", "Sname", "email", "Memid","Deptid"],
             columns_type=["int", "varchar", "varchar", "int", "int"],
             num=[10,255,255,10,10],
             primary_key=["Stuid"],
             foreign_key=["Memid","Deptid"],
             reference=["Member(Memid)", "Department(Deptid)"]
            )

create table Student(Stuid int(10),Sname varchar(255),email varchar(255),Memid int(10),Deptid int(10),primary key(Stuid),foreign key (Memid) references Member(Memid),foreign key (Deptid) references Department(Deptid))

In [217]:
Table_Type(mycursor, table_name="Student")

+--------+-----------------+------+-----+---------+-------+
| Field  |       Type      | Null | Key | Default | Extra |
+--------+-----------------+------+-----+---------+-------+
| Stuid  |      b'int'     |  NO  | PRI |   None  |       |
| Sname  | b'varchar(255)' | YES  |     |   None  |       |
| email  | b'varchar(255)' | YES  |     |   None  |       |
| Memid  |      b'int'     | YES  | MUL |   None  |       |
| Deptid |      b'int'     | YES  | MUL |   None  |       |
+--------+-----------------+------+-----+---------+-------+

## Inserting values into Database

In [214]:
mycursor.execute("show tables")

In [215]:
mycursor.fetchall()

[('A_Specialization',),
 ('Author',),
 ('Books',),
 ('Department',),
 ('Dummy',),
 ('Employee',),
 ('Ilibrary',),
 ('Issue',),
 ('Member',),
 ('Noofcopies',),
 ('Publisher',),
 ('Purchase',),
 ('Seller',),
 ('Sells',),
 ('SiuLibrary1',),
 ('Staff',),
 ('Writes',)]

In [131]:
# 1. Specialization

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Specialization.csv")

In [133]:
df.drop("Unnamed: 3", axis = 1, inplace = True)
df.head()

   SpecId                       SpecName   Aid
0   13000   Masters of business in Katta  4000
1   13001  Masters of business in  Barfi  4001
2   13002     Masters of business in Car  4002
3   13003    Masters of business in Wine  4003

In [145]:
for i in range(len(df)):
    Insert_into_Table(mycursor,table_name="A_Specialization",values=list(df.iloc[i]))

insert into A_Specialization(Spec_id,Spec_name,Aid) values(13000,'Masters of business in Katta',4000)
insert into A_Specialization(Spec_id,Spec_name,Aid) values(13001,'Masters of business in  Barfi',4001)
insert into A_Specialization(Spec_id,Spec_name,Aid) values(13002,'Masters of business in Car',4002)
insert into A_Specialization(Spec_id,Spec_name,Aid) values(13003,'Masters of business in Wine',4003)

In [146]:
Show_Table(mycursor, table_name="A_Specialization")

+---------+-------------------------------+------+
| Spec_id |           Spec_name           | Aid  |
+---------+-------------------------------+------+
|  13000  |  Masters of business in Katta | 4000 |
|  13001  | Masters of business in  Barfi | 4001 |
|  13002  |   Masters of business in Car  | 4002 |
|  13003  |  Masters of business in Wine  | 4003 |
+---------+-------------------------------+------+

In [150]:
# 2. SiuLibrary

df = pd.read_csv("Desktop/DBMS/DBMS dataset/SiuLibrary.csv")

In [152]:
df.drop(["Unnamed: 4", "Unnamed: 5"], axis = 1, inplace = True)
df.head()

   Slid         lname  Location  Noofbranches
0  1000  Mirzapur_lib  Mirzapur             2
1  1001  Johnpur _lib   Johnpur             2
2  1002     Bihar_lib     Bihar             2

In [154]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="SiuLibrary1", values=list(df.iloc[i]))

insert into SiuLibrary1(Slid,lname,location,noofbranches) values(1000,'Mirzapur_lib','Mirzapur',2)
insert into SiuLibrary1(Slid,lname,location,noofbranches) values(1001,'Johnpur _lib','Johnpur',2)
insert into SiuLibrary1(Slid,lname,location,noofbranches) values(1002,'Bihar_lib','Bihar',2)

In [155]:
Show_Table(mycursor, table_name="SiuLibrary1")

+------+--------------+----------+--------------+
| Slid |    lname     | location | noofbranches |
+------+--------------+----------+--------------+
| 1000 | Mirzapur_lib | Mirzapur |      2       |
| 1001 | Johnpur _lib | Johnpur  |      2       |
| 1002 |  Bihar_lib   |  Bihar   |      2       |
+------+--------------+----------+--------------+

In [159]:
# 3. LLibrary

df = pd.read_csv("Desktop/DBMS/DBMS dataset/LLibrary.csv") 
df.head()

    Lid         lname      City      Area  Slid
0  2000  Mirzapur_lib  Mirzapur  Tripathi  1000
1  2001  Mirzapur_lib  Mirzapur  Tripathi  1000
2  2002   Johnpur_lib   Johnpur   Shankar  1001
3  2003   Johnpur_lib   Johnpur   Shankar  1001
4  2004     Bihar_lib     Bihar     Tyagi  1002

In [160]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Ilibrary", values=list(df.iloc[i]))

insert into Ilibrary(Lid,lname,City,Area,Slid) values(2000,'Mirzapur_lib','Mirzapur','Tripathi',1000)
insert into Ilibrary(Lid,lname,City,Area,Slid) values(2001,'Mirzapur_lib','Mirzapur','Tripathi',1000)
insert into Ilibrary(Lid,lname,City,Area,Slid) values(2002,'Johnpur_lib','Johnpur','Shankar',1001)
insert into Ilibrary(Lid,lname,City,Area,Slid) values(2003,'Johnpur_lib','Johnpur','Shankar',1001)
insert into Ilibrary(Lid,lname,City,Area,Slid) values(2004,'Bihar_lib','Bihar','Tyagi',1002)
insert into Ilibrary(Lid,lname,City,Area,Slid) values(2005,'Bihar_lib','Bihar','Tyagi',1002)

In [161]:
# 4. Books

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Books.csv")
df.head()

    Bid             BName  Price   Lid
0  3000  Katto ka vyapaar   1000  2000
1  3001  Barfi ka vyapaar   5000  2000
2  3002  Katto ka vyapaar   1000  2001
3  3003  Barfi ka vyapaar   5000  2001
4  3004   Wine ka Vyapaar   2000  2002

In [162]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Books", values=list(df.iloc[i]))

insert into Books(Bid,Bname,Price,Lid) values(3000,'Katto ka vyapaar',1000,2000)
insert into Books(Bid,Bname,Price,Lid) values(3001,'Barfi ka vyapaar',5000,2000)
insert into Books(Bid,Bname,Price,Lid) values(3002,'Katto ka vyapaar',1000,2001)
insert into Books(Bid,Bname,Price,Lid) values(3003,'Barfi ka vyapaar',5000,2001)
insert into Books(Bid,Bname,Price,Lid) values(3004,'Wine ka Vyapaar',2000,2002)
insert into Books(Bid,Bname,Price,Lid) values(3005,'Wine ka Vyapaar',2000,2003)
insert into Books(Bid,Bname,Price,Lid) values(3006,'Car ka Vyapaar',3000,2004)
insert into Books(Bid,Bname,Price,Lid) values(3007,'Katto ka Vyapper',1000,2004)
insert into Books(Bid,Bname,Price,Lid) values(3008,'Barfi ka Vyapaar',5000,2004)
insert into Books(Bid,Bname,Price,Lid) values(3009,'Car ka Vyapaar',3000,2005)
insert into Books(Bid,Bname,Price,Lid) values(3010,'Katto ka Vyapper',1000,2005)
insert into Books(Bid,Bname,Price,Lid) values(3011,'Barfi ka Vyapaar',5000,2005)

In [163]:
Show_Table(mycursor, table_name="Books")

+------+------------------+-------+------+
| Bid  |      Bname       | Price | Lid  |
+------+------------------+-------+------+
| 3000 | Katto ka vyapaar |  1000 | 2000 |
| 3001 | Barfi ka vyapaar |  5000 | 2000 |
| 3002 | Katto ka vyapaar |  1000 | 2001 |
| 3003 | Barfi ka vyapaar |  5000 | 2001 |
| 3004 | Wine ka Vyapaar  |  2000 | 2002 |
| 3005 | Wine ka Vyapaar  |  2000 | 2003 |
| 3006 |  Car ka Vyapaar  |  3000 | 2004 |
| 3007 | Katto ka Vyapper |  1000 | 2004 |
| 3008 | Barfi ka Vyapaar |  5000 | 2004 |
| 3009 |  Car ka Vyapaar  |  3000 | 2005 |
| 3010 | Katto ka Vyapper |  1000 | 2005 |
| 3011 | Barfi ka Vyapaar |  5000 | 2005 |
+------+------------------+-------+------+

In [164]:
# 5. Author

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Author.csv")
df.head()

    Aid      Author Name                              Email   phone.no
0  4000     Munna Bhaiya   munna.king_of_mirzapur@gmail.com  959396930
1  4001             Ali           Ali.with_guddu@gmail.com   959294729
2  4002       Bade Tyagi      dadda.king_of_bihar@gmail.com  947253751
3  4003  Shankar_factory  shankar.king_of_johnpur@gmail.com  867295361

In [165]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Author", values=list(df.iloc[i]))

insert into Author(Aid,Aname,email,PhoneNo) values(4000,'Munna Bhaiya','munna.king_of_mirzapur@gmail.com',959396930)
insert into Author(Aid,Aname,email,PhoneNo) values(4001,'Ali ','Ali.with_guddu@gmail.com ',959294729)
insert into Author(Aid,Aname,email,PhoneNo) values(4002,'Bade Tyagi','dadda.king_of_bihar@gmail.com',947253751)
insert into Author(Aid,Aname,email,PhoneNo) values(4003,'Shankar_factory','shankar.king_of_johnpur@gmail.com',867295361)

In [166]:
Show_Table(mycursor, table_name="Author")

+------+-----------------+-----------------------------------+-----------+
| Aid  |      Aname      |               email               |  PhoneNo  |
+------+-----------------+-----------------------------------+-----------+
| 4000 |   Munna Bhaiya  |  munna.king_of_mirzapur@gmail.com | 959396930 |
| 4001 |       Ali       |     Ali.with_guddu@gmail.com      | 959294729 |
| 4002 |    Bade Tyagi   |   dadda.king_of_bihar@gmail.com   | 947253751 |
| 4003 | Shankar_factory | shankar.king_of_johnpur@gmail.com | 867295361 |
+------+-----------------+-----------------------------------+-----------+

In [169]:
# 6. Writes

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Writes.csv")
df.drop("Unnamed: 3", axis = 1, inplace = True)
df.head()

    Bid   Aid   Pid
0  3000  4000  5000
1  3001  4001  5001
2  3002  4002  5002
3  3003  4003  5003

In [170]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Writes", values=list(df.iloc[i]))

insert into Writes(Bid,Aid,Pid) values(3000,4000,5000)
insert into Writes(Bid,Aid,Pid) values(3001,4001,5001)
insert into Writes(Bid,Aid,Pid) values(3002,4002,5002)
insert into Writes(Bid,Aid,Pid) values(3003,4003,5003)

In [173]:
# 7. Publisher

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Publisher.csv")
df.drop(["Unnamed: 2" ,"Unnamed: 3"], axis = 1, inplace = True)
df.head()

    Pid           PName
0  5000  Kaalien Bhaiya
1  5001    Guddu Bhaiya
2  5002     Dadda Tyagi
3  5003    Rati Shankar

In [174]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Publisher", values= list(df.iloc[i]))

insert into Publisher(Pid,Pname) values(5000,'Kaalien Bhaiya')
insert into Publisher(Pid,Pname) values(5001,'Guddu Bhaiya')
insert into Publisher(Pid,Pname) values(5002,'Dadda Tyagi')
insert into Publisher(Pid,Pname) values(5003,'Rati Shankar')

In [175]:
Show_Table(mycursor, table_name="Publisher")

+------+----------------+
| Pid  |     Pname      |
+------+----------------+
| 5000 | Kaalien Bhaiya |
| 5001 |  Guddu Bhaiya  |
| 5002 |  Dadda Tyagi   |
| 5003 |  Rati Shankar  |
+------+----------------+

In [177]:
#  8. Seller

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Seller.csv")
df.drop("Unnamed: 3", axis = 1, inplace = True)
df.head()

    Sid       Slname       City
0  6000      Makbool   Mirzapur
1  6001         Golu  Sultanpur
2  6002  Chote Tyagi      Bihar
3  6003       Sharad    Johnpur

In [178]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Seller", values=list(df.iloc[i]))

insert into Seller(Sid,slname,City) values(6000,'Makbool','Mirzapur')
insert into Seller(Sid,slname,City) values(6001,'Golu','Sultanpur')
insert into Seller(Sid,slname,City) values(6002,'Chote Tyagi','Bihar')
insert into Seller(Sid,slname,City) values(6003,'Sharad','Johnpur')

In [179]:
Show_Table(mycursor, table_name="Seller")

+------+-------------+-----------+
| Sid  |    slname   |    City   |
+------+-------------+-----------+
| 6000 |   Makbool   |  Mirzapur |
| 6001 |     Golu    | Sultanpur |
| 6002 | Chote Tyagi |   Bihar   |
| 6003 |    Sharad   |  Johnpur  |
+------+-------------+-----------+

In [191]:
# 9. Department

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Department.csv")
df.head()

   Deptid Deptname         lname   Lid
0    8000    Katta  Mirzapur_lib  2000
1    8001    Barfi  Mirzapur_lib  2000
2    8002    Katta  Mirzapur_lib  2001
3    8003    Barfi  Mirzapur_lib  2001
4    8004     Wine   Johnpur_lib  2002

In [192]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Department", values=list(df.iloc[i]))

insert into Department(DeptId,Deptname,Iname,Lid) values(8000,'Katta','Mirzapur_lib',2000)
insert into Department(DeptId,Deptname,Iname,Lid) values(8001,'Barfi','Mirzapur_lib',2000)
insert into Department(DeptId,Deptname,Iname,Lid) values(8002,'Katta','Mirzapur_lib',2001)
insert into Department(DeptId,Deptname,Iname,Lid) values(8003,'Barfi','Mirzapur_lib',2001)
insert into Department(DeptId,Deptname,Iname,Lid) values(8004,'Wine','Johnpur_lib',2002)
insert into Department(DeptId,Deptname,Iname,Lid) values(8005,'Wine','Johnpur_lib',2002)
insert into Department(DeptId,Deptname,Iname,Lid) values(8006,'Car','Bihar_lib',2003)
insert into Department(DeptId,Deptname,Iname,Lid) values(8007,'Katta','Bihar_lib',2003)
insert into Department(DeptId,Deptname,Iname,Lid) values(8008,'Barfi','Bihar_lib',2004)
insert into Department(DeptId,Deptname,Iname,Lid) values(8009,'Car','Bihar_lib',2004)
insert into Department(DeptId,Deptname,Iname,Lid) values(8010,'Katta','Bihar_lib',2005)
insert into Department(DeptId,Deptname,Iname,Lid) values(8011,'Barfi','Bihar_lib',2005)

In [193]:
Show_Table(mycursor, table_name="Department")

+--------+----------+--------------+------+
| DeptId | Deptname |    Iname     | Lid  |
+--------+----------+--------------+------+
|  8000  |  Katta   | Mirzapur_lib | 2000 |
|  8001  |  Barfi   | Mirzapur_lib | 2000 |
|  8002  |  Katta   | Mirzapur_lib | 2001 |
|  8003  |  Barfi   | Mirzapur_lib | 2001 |
|  8004  |   Wine   | Johnpur_lib  | 2002 |
|  8005  |   Wine   | Johnpur_lib  | 2002 |
|  8006  |   Car    |  Bihar_lib   | 2003 |
|  8007  |  Katta   |  Bihar_lib   | 2003 |
|  8008  |  Barfi   |  Bihar_lib   | 2004 |
|  8009  |   Car    |  Bihar_lib   | 2004 |
|  8010  |  Katta   |  Bihar_lib   | 2005 |
|  8011  |  Barfi   |  Bihar_lib   | 2005 |
+--------+----------+--------------+------+

In [199]:
# 10. Sells

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Sells.csv")
df.head()

    Sid   Bid   Pid
0  6000  3000  5000
1  6001  3001  5001
2  6002  3002  5002
3  6003  3003  5003

In [200]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Sells", values=list(df.iloc[i]))

insert into Sells(Sid,Bid,Pid) values(6000,3000,5000)
insert into Sells(Sid,Bid,Pid) values(6001,3001,5001)
insert into Sells(Sid,Bid,Pid) values(6002,3002,5002)
insert into Sells(Sid,Bid,Pid) values(6003,3003,5003)

In [201]:
Show_Table(mycursor, table_name="Sells")

+------+------+------+
| Sid  | Bid  | Pid  |
+------+------+------+
| 6000 | 3000 | 5000 |
| 6001 | 3001 | 5001 |
| 6002 | 3002 | 5002 |
| 6003 | 3003 | 5003 |
+------+------+------+

In [203]:
# 11. Employee

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Employee.csv")
df.drop("Unnamed: 5", axis = 1, inplace = True)
df.head()

     Eid  Empname        Email  Salary   Lid
0  10000  Dummy 1  1@gmail.com   10000  2000
1  10001  Dummy 2  2@gmail.com    5000  2000
2  10002  Dummy 3  3@gmail.com   10000  2001
3  10003  Dummy 4  4@gmail.com    5000  2001
4  10004  Dummy 5  5@gmail.com   10000  2002

In [204]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Employee", values=list(df.iloc[i]))

insert into Employee(Eid,Empname,email,Salary,Lid) values(10000,'Dummy 1','1@gmail.com',10000,2000)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10001,'Dummy 2','2@gmail.com',5000,2000)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10002,'Dummy 3','3@gmail.com',10000,2001)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10003,'Dummy 4','4@gmail.com',5000,2001)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10004,'Dummy 5','5@gmail.com',10000,2002)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10005,'Dummy 6','6@gmail.com',5000,2002)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10006,'Dummy 7','7@gmail.com',10000,2003)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10007,'Dummy 8','8@gmail.com',5000,2003)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10008,'Dummy 9','9@gmail.com',10000,2004)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10009,'Dummy 10','10@gmail.com',5000,2004)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10010,'Dummy 11','11@gmail.com',10000,2005)
insert into Employee(Eid,Empname,email,Salary,Lid) values(10011,'Dummy 12','12@gmail.com',5000,2005)

In [205]:
Show_Table(mycursor, table_name="Employee")

+-------+----------+--------------+--------+------+
|  Eid  | Empname  |    email     | Salary | Lid  |
+-------+----------+--------------+--------+------+
| 10000 | Dummy 1  | 1@gmail.com  | 10000  | 2000 |
| 10001 | Dummy 2  | 2@gmail.com  |  5000  | 2000 |
| 10002 | Dummy 3  | 3@gmail.com  | 10000  | 2001 |
| 10003 | Dummy 4  | 4@gmail.com  |  5000  | 2001 |
| 10004 | Dummy 5  | 5@gmail.com  | 10000  | 2002 |
| 10005 | Dummy 6  | 6@gmail.com  |  5000  | 2002 |
| 10006 | Dummy 7  | 7@gmail.com  | 10000  | 2003 |
| 10007 | Dummy 8  | 8@gmail.com  |  5000  | 2003 |
| 10008 | Dummy 9  | 9@gmail.com  | 10000  | 2004 |
| 10009 | Dummy 10 | 10@gmail.com |  5000  | 2004 |
| 10010 | Dummy 11 | 11@gmail.com | 10000  | 2005 |
| 10011 | Dummy 12 | 12@gmail.com |  5000  | 2005 |
+-------+----------+--------------+--------+------+

In [207]:
# 12. Member

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Member.csv")
df.drop(["Unnamed: 2", "Unnamed: 3"], axis = 1, inplace = True)
df.head()

   MemId   Lid
0  11000  2000
1  11001  2000
2  11002  2001
3  11003  2001
4  11004  2002

In [208]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Member", values=list(df.iloc[i]))

insert into Member(MemId,Lid) values(11000,2000)
insert into Member(MemId,Lid) values(11001,2000)
insert into Member(MemId,Lid) values(11002,2001)
insert into Member(MemId,Lid) values(11003,2001)
insert into Member(MemId,Lid) values(11004,2002)
insert into Member(MemId,Lid) values(11005,2002)
insert into Member(MemId,Lid) values(11006,2003)
insert into Member(MemId,Lid) values(11007,2003)
insert into Member(MemId,Lid) values(11008,2004)
insert into Member(MemId,Lid) values(11009,2004)
insert into Member(MemId,Lid) values(11010,2005)
insert into Member(MemId,Lid) values(11011,2005)

In [209]:
Show_Table(mycursor, table_name="Member")

+-------+------+
| MemId | Lid  |
+-------+------+
| 11000 | 2000 |
| 11001 | 2000 |
| 11002 | 2001 |
| 11003 | 2001 |
| 11004 | 2002 |
| 11005 | 2002 |
| 11006 | 2003 |
| 11007 | 2003 |
| 11008 | 2004 |
| 11009 | 2004 |
| 11010 | 2005 |
| 11011 | 2005 |
+-------+------+

In [221]:
#13 

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Student.csv")
df.head()

   Studid    Sname              Email    Mom  DeptId
0    7000  Santosh  santosh@gmail.com  11001    8000
1    7001   Mukesh   mukesh@gmail.com  11003    8001
2    7002    Harsh    harsh@gmail.com  11005    8002
3    7003    Shrey    shrey@gmail.com  11007    8003
4    7004   Muskan   muskan@gmail.com  11009    8004

In [222]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Student", values=list(df.iloc[i]))

insert into Student(Stuid,Sname,email,Memid,Deptid) values(7000,'Santosh','santosh@gmail.com',11001,8000)
insert into Student(Stuid,Sname,email,Memid,Deptid) values(7001,'Mukesh','mukesh@gmail.com',11003,8001)
insert into Student(Stuid,Sname,email,Memid,Deptid) values(7002,'Harsh','harsh@gmail.com',11005,8002)
insert into Student(Stuid,Sname,email,Memid,Deptid) values(7003,'Shrey','shrey@gmail.com',11007,8003)
insert into Student(Stuid,Sname,email,Memid,Deptid) values(7004,'Muskan','muskan@gmail.com',11009,8004)
insert into Student(Stuid,Sname,email,Memid,Deptid) values(7005,'Sudarshan','sudarshan@gmail.com',11011,8005)

In [223]:
Show_Table(mycursor, table_name="Student")

+-------+-----------+---------------------+-------+--------+
| Stuid |   Sname   |        email        | Memid | Deptid |
+-------+-----------+---------------------+-------+--------+
|  7000 |  Santosh  |  santosh@gmail.com  | 11001 |  8000  |
|  7001 |   Mukesh  |   mukesh@gmail.com  | 11003 |  8001  |
|  7002 |   Harsh   |   harsh@gmail.com   | 11005 |  8002  |
|  7003 |   Shrey   |   shrey@gmail.com   | 11007 |  8003  |
|  7004 |   Muskan  |   muskan@gmail.com  | 11009 |  8004  |
|  7005 | Sudarshan | sudarshan@gmail.com | 11011 |  8005  |
+-------+-----------+---------------------+-------+--------+

In [229]:
# 14. Staff

df = pd.read_csv("Desktop/DBMS/DBMS dataset/Staff-Table 1.csv")

df.head()

    Stid         Stname              Email    Mom  DeptId
0  12000  Madhuri Yadav  madhuri@gmail.com  11000    8000
1  12001  B wale Chacha   chacha@gmail.com  11002    8001
2  12002     Uncle John    uncle@gmail.com  11004    8002
3  12003     Vimal bolo    vimal@gmail.com  11006    8003
4  12004       JP Yadav    yadav@gmail.com  11008    8004

In [233]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Staff", values=list(df.iloc[i]))

insert into Staff(Stid,stname,email,MemId,DeptId) values(12000,'Madhuri Yadav','madhuri@gmail.com',11000,8000)
insert into Staff(Stid,stname,email,MemId,DeptId) values(12001,'B wale Chacha','chacha@gmail.com',11002,8001)
insert into Staff(Stid,stname,email,MemId,DeptId) values(12002,'Uncle John','uncle@gmail.com',11004,8002)
insert into Staff(Stid,stname,email,MemId,DeptId) values(12003,'Vimal bolo','vimal@gmail.com',11006,8003)
insert into Staff(Stid,stname,email,MemId,DeptId) values(12004,'JP Yadav','yadav@gmail.com',11008,8004)
insert into Staff(Stid,stname,email,MemId,DeptId) values(12005,'ThandePapa','thandepapa@gmail.com',11010,8005)

In [234]:
Show_Table(mycursor, table_name="Staff")

+-------+---------------+----------------------+-------+--------+
|  Stid |     stname    |        email         | MemId | DeptId |
+-------+---------------+----------------------+-------+--------+
| 12000 | Madhuri Yadav |  madhuri@gmail.com   | 11000 |  8000  |
| 12001 | B wale Chacha |   chacha@gmail.com   | 11002 |  8001  |
| 12002 |   Uncle John  |   uncle@gmail.com    | 11004 |  8002  |
| 12003 |   Vimal bolo  |   vimal@gmail.com    | 11006 |  8003  |
| 12004 |    JP Yadav   |   yadav@gmail.com    | 11008 |  8004  |
| 12005 |   ThandePapa  | thandepapa@gmail.com | 11010 |  8005  |
+-------+---------------+----------------------+-------+--------+

In [241]:
Show_Table(mycursor, table_name="Books")

+------+------------------+-------+------+
| Bid  |      Bname       | Price | Lid  |
+------+------------------+-------+------+
| 3000 | Katto ka vyapaar |  1000 | 2000 |
| 3001 | Barfi ka vyapaar |  5000 | 2000 |
| 3002 | Katto ka vyapaar |  1000 | 2001 |
| 3003 | Barfi ka vyapaar |  5000 | 2001 |
| 3004 | Wine ka Vyapaar  |  2000 | 2002 |
| 3005 | Wine ka Vyapaar  |  2000 | 2003 |
| 3006 |  Car ka Vyapaar  |  3000 | 2004 |
| 3007 | Katto ka Vyapper |  1000 | 2004 |
| 3008 | Barfi ka Vyapaar |  5000 | 2004 |
| 3009 |  Car ka Vyapaar  |  3000 | 2005 |
| 3010 | Katto ka Vyapper |  1000 | 2005 |
| 3011 | Barfi ka Vyapaar |  5000 | 2005 |
+------+------------------+-------+------+

In [242]:
Show_Table(mycursor, table_name="Member")

+-------+------+
| MemId | Lid  |
+-------+------+
| 11000 | 2000 |
| 11001 | 2000 |
| 11002 | 2001 |
| 11003 | 2001 |
| 11004 | 2002 |
| 11005 | 2002 |
| 11006 | 2003 |
| 11007 | 2003 |
| 11008 | 2004 |
| 11009 | 2004 |
| 11010 | 2005 |
| 11011 | 2005 |
+-------+------+

In [248]:
# 15. Noof copies
df = pd.read_csv("Desktop/DBMS/DBMS Dataset1/Noofcopies-Table 1.csv")
df.head()

   Bnid   Bid  Blid
0  9000  3000  5000
1  9001  3001  5001
2  9002  3002  5002
3  9003  3003  5003
4  9004  3004  5004

In [249]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Noofcopies", values=list(df.iloc[i]))

insert into Noofcopies(Bnid,Bid,Blid) values(9000,3000,5000)
insert into Noofcopies(Bnid,Bid,Blid) values(9001,3001,5001)
insert into Noofcopies(Bnid,Bid,Blid) values(9002,3002,5002)
insert into Noofcopies(Bnid,Bid,Blid) values(9003,3003,5003)
insert into Noofcopies(Bnid,Bid,Blid) values(9004,3004,5004)
insert into Noofcopies(Bnid,Bid,Blid) values(9005,3005,5005)
insert into Noofcopies(Bnid,Bid,Blid) values(9006,3006,5006)
insert into Noofcopies(Bnid,Bid,Blid) values(9007,3007,5007)
insert into Noofcopies(Bnid,Bid,Blid) values(9008,3008,5008)
insert into Noofcopies(Bnid,Bid,Blid) values(9009,3009,5009)
insert into Noofcopies(Bnid,Bid,Blid) values(9010,3010,5010)
insert into Noofcopies(Bnid,Bid,Blid) values(9011,3011,5011)

In [250]:
Show_Table(mycursor, "Noofcopies")

+------+------+------+
| Bnid | Bid  | Blid |
+------+------+------+
| 9000 | 3000 | 5000 |
| 9001 | 3001 | 5001 |
| 9002 | 3002 | 5002 |
| 9003 | 3003 | 5003 |
| 9004 | 3004 | 5004 |
| 9005 | 3005 | 5005 |
| 9006 | 3006 | 5006 |
| 9007 | 3007 | 5007 |
| 9008 | 3008 | 5008 |
| 9009 | 3009 | 5009 |
| 9010 | 3010 | 5010 |
| 9011 | 3011 | 5011 |
+------+------+------+

In [260]:
# 16 Purchase

df = pd.read_csv("Desktop/DBMS/DBMS Dataset1/Purchase-Table 1.csv")
df.head()

    Prid   Lid   Sid   Pid   Bid  Quantity        Date  Total Cost
0  14000  2000  6000  5000  3000         3  10/10/2000       10000
1  14001  2002  6003  5003  3004         5  11/10/2000       20000
2  14002  2004  6001  5001  3008         1  12/10/2000        4000
3  14003  2005  6000  5000  3010         3  13/10/2000       20000
4  14004  2003  6003  5003  3005         4  14/10/2000       60000

In [261]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Purchase", values=list(df.iloc[i]))

insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14000,2000,6000,5000,3000,3,'10/10/2000',10000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14001,2002,6003,5003,3004,5,'11/10/2000',20000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14002,2004,6001,5001,3008,1,'12/10/2000',4000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14003,2005,6000,5000,3010,3,'13/10/2000',20000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14004,2003,6003,5003,3005,4,'14/10/2000',60000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14005,2001,6000,5000,3002,2,'15/10/2000',10000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14006,2000,6001,5001,3001,3,'16/10/2000',20000)
insert into Purchase(PrId,Lid,Sid,Pid,Bid,Quantity,Date,TotalCost) values(14007,2001,6001,5001,3003,1,'17/10/2000',5000)

In [262]:
Show_Table(mycursor,"Purchase")

+-------+------+------+------+------+----------+------------+-----------+
|  PrId | Lid  | Sid  | Pid  | Bid  | Quantity |    Date    | TotalCost |
+-------+------+------+------+------+----------+------------+-----------+
| 14000 | 2000 | 6000 | 5000 | 3000 |    3     | 10/10/2000 |   10000   |
| 14001 | 2002 | 6003 | 5003 | 3004 |    5     | 11/10/2000 |   20000   |
| 14002 | 2004 | 6001 | 5001 | 3008 |    1     | 12/10/2000 |    4000   |
| 14003 | 2005 | 6000 | 5000 | 3010 |    3     | 13/10/2000 |   20000   |
| 14004 | 2003 | 6003 | 5003 | 3005 |    4     | 14/10/2000 |   60000   |
| 14005 | 2001 | 6000 | 5000 | 3002 |    2     | 15/10/2000 |   10000   |
| 14006 | 2000 | 6001 | 5001 | 3001 |    3     | 16/10/2000 |   20000   |
| 14007 | 2001 | 6001 | 5001 | 3003 |    1     | 17/10/2000 |    5000   |
+-------+------+------+------+------+----------+------------+-----------+

In [267]:
# 17. Issue

df = pd.read_csv("Desktop/DBMS/DBMS Dataset1/Return-Table 1.csv")
df.head()

   Issueid  Memid   Bid   Lid  Issue date Return Date
0    20000  11000  3000  2000  10/10/2020  10/11/2020
1    20001  11001  3001  2000  11/10/2020  11/11/2020
2    20002  11002  3002  2001  12/10/2020  12/11/2020
3    20003  11003  3003  2001  13/10/2020  13/11/2020
4    20004  11004  3004  2002  14/10/2020  14/11/2020

In [268]:
for i in range(len(df)):
    Insert_into_Table(mycursor, table_name="Issue", values=list(df.iloc[i]))

insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20000,11000,3000,2000,'10/10/2020','10/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20001,11001,3001,2000,'11/10/2020','11/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20002,11002,3002,2001,'12/10/2020','12/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20003,11003,3003,2001,'13/10/2020','13/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20004,11004,3004,2002,'14/10/2020','14/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20005,11006,3005,2003,'15/10/2020','15/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20006,11008,3006,2004,'16/10/2020','16/11/2020')
insert into Issue(Issueid,Memid,Bid,Lid,Issuedate,Returndate) values(20007,11009,3007,2004,'17/10/2020','17/11/2020')

In [269]:
Show_Table(mycursor, "Issue")

+---------+-------+------+------+------------+------------+
| Issueid | Memid | Bid  | Lid  | Issuedate  | Returndate |
+---------+-------+------+------+------------+------------+
|  20000  | 11000 | 3000 | 2000 | 10/10/2020 | 10/11/2020 |
|  20001  | 11001 | 3001 | 2000 | 11/10/2020 | 11/11/2020 |
|  20002  | 11002 | 3002 | 2001 | 12/10/2020 | 12/11/2020 |
|  20003  | 11003 | 3003 | 2001 | 13/10/2020 | 13/11/2020 |
|  20004  | 11004 | 3004 | 2002 | 14/10/2020 | 14/11/2020 |
|  20005  | 11006 | 3005 | 2003 | 15/10/2020 | 15/11/2020 |
|  20006  | 11008 | 3006 | 2004 | 16/10/2020 | 16/11/2020 |
|  20007  | 11009 | 3007 | 2004 | 17/10/2020 | 17/11/2020 |
+---------+-------+------+------+------------+------------+